Autodesk.Revit.DB.Electrical.CableTray.IsValidCableTrayType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if a cable tray type is valid.
document:
The document.
cabletrayType:
The cable tray type.
Returns:
True if the cable tray type is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.CableTray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a new instance of cable tray.
Remarks:
This method will regenerate the document.
document:
The document.
cabletrayType:
The cable tray type.  This must be a cable tray type accepted by isValidCableTrayType().
If the input cable tray type is InvalidElementId, the default cable tray type from the document will be used.
startPoint:
The start point of the cable tray location line.
endPoint:
The end point of the cable tray location line.
levelId:
The element id of the level which this cable tray based.
If the input level id is invalidElementId = -1, the nearest level will be used.
Returns:
The newly created cable tray.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This cable tray type is invalid.
-or-
This level id is invalid.
-or-
The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Electrical.CableTray.CurveNormal
The up-direction vector of the cable tray.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014